package pro.sky.animalShelter.constants;

public class
Constants {
    /**
     * Приветствие
     */
    public static String MEET = "Хай, ты попал в бот приюта животных. Тыкай кнопочки для того, чтобы найти всю необходимую для себя информацию.";

    /**
     * Информация о приюте
     */
    public static String INFO_SHELTER = " - ";

    /**
     * График работы
     */
    public static String SHEDULE = "Наш приют работает ежедневно с 9 до 20 часов";


    /**
     * Правила нахождения в приюте
     */
    public static String RULES = "- .\n" +
            "- Строго запрещается самостоятельно открывать вольеры и заходить к незнакомым собакам, пересаживать собак в другие вольеры, а также выпускать собак из вольеров без разрешения или присутствия сотрудников приюта. \n" +
            "- Запрещается кормить животных пищей, не соответствующей установленному рациону и графику кормления. \n" +
            "- Запрещается бросать еду, лакомства или любые предметы через решётку вольера. \n" +
            "- Посещение детьми среднего и старшего школьного возраста разрешается только в присутствии взрослых или при наличии их письменного согласия, переданного администрации приюта заранее. \n" +
            "- Строго запрещается давать животным любые лекарственные препараты и добавки без согласования с работником ветеринарного кабинета. .\n";

    /**
     * Номер волонтера
     */
    public static String PHONE_VOLUNTEER = " Номер волонтёра, который сможет ответить на все интересующие вас вопросы: +79217777777.";

    /**
     * Запись контактных данных
     */
    public static String CALL_BACK = " Оставьте, пожалуйста, ваши контактные данные для связи с волонтёром, а именно: адрес электронной почты, номер мобильного телефона, а также ваш Telegram username .";

    /**
     * Правила знакомства с животным
     */
    public static String RULES_FOR_MEETING_ANIMALS = "-.\n" ;


    /**
     * Обустройство дома для животного
     */
    public static String RECOMENDATIONS_FOR_HOUSE_FOR_ANIMAL = "Список рекомендаций :\n" +
            "- Выберите подходящее место. Это должно быть спокойное и безопасное пространство вдали от проходных зон. Избегайте сквозняков и прямых солнечных лучей.\n" +
            "- Лежанка или домик должны подходить по размеру питомцу. Подстилка должна быть мягкой и удобной.\n" +
            "- Учтите породу и возраст питомца при выборе места и обустройстве. Для животных с особыми потребностями по медицинским показаниям подберите специальные приспособления и аксессуары.\n";


    /**
     * Причины для отказа.
     */
    public static String REASONS_FOR_REFUSAL = "Список причин, почему могут отказать в выдаче собаки из приюта:**\n" +
            "\n" +
            "* **Несоответствие требованиям:** Приют может установить определенные требования к потенциальным владельцам, такие как возраст, образ жизни и опыт содержания животных. Если вы не соответствуете этим требованиям, вам могут отказать в выдаче собаки.\n" +
            "* **Неподходящий дом:** Приют проверит ваш дом, чтобы убедиться, что он безопасен и подходит для собаки. Если ваш дом не соответствует стандартам приюта, вам могут отказать в выдаче собаки.\n" +
            "* **Недостаточный опыт:** Если у вас нет опыта содержания собак или вы не можете продемонстрировать, что вы готовы взять на себя ответственность за собаку, вам могут отказать в выдаче.\n" +
            "* **Негативная история обращения с животными:** Если у вас есть история жестокого обращения с животными или пренебрежения ими, вам могут отказать в выдаче собаки.\n" +
            "* **Сомнения относительно мотивов:** Приют может отклонить вашу заявку, если у них есть сомнения относительно ваших мотивов для получения собаки, например, если вы планируете использовать собаку для разведения или в качестве сторожевого животного.\n" +
            "* **Негативные рекомендации:** Если приют получит негативные рекомендации от ваших предыдущих арендодателей, соседей или ветеринаров, вам могут отказать в выдаче собаки.\n" +
            "* **Слишком много домашних животных:** Приют может ограничить количество домашних животных, которых может содержать один человек. Если у вас уже есть много домашних животных, вам могут отказать в выдаче собаки.\n" +
            "* **Медицинские ограничения:** Если у вас аллергия на собак или другие медицинские ограничения, которые могут помешать вам обеспечить надлежащий уход за собакой, вам могут отказать в выдаче.\n" +
            "* **Финансовые проблемы:** Приюты могут потребовать доказательства того, что у вас есть финансовые возможности, чтобы обеспечить собаке надлежащий уход. Если вы не можете продемонстрировать финансовую стабильность, вам могут отказать в выдаче собаки.\n" +
            "* **Другие факторы:** Каждый приют может иметь свои собственные дополнительные факторы, которые могут повлиять на решение о выдаче собаки. Например, некоторые приюты могут отдавать предпочтение семьям с детьми или людям, имеющим большой опыт содержания определенных пород собак.";


    public static String CONGRATULATIONS = "связь - ";

    /**
     * Контакты для закзаза пропуска
     */
    public static String GUARD_CONTACTS = " Контакты для закзаза пропуска: +79888888888";

    /**
     * Список документов для усыновления питомца
     */
    public static String DOCUMENTS_FOR_ADOPTION = "Какие документы нужны чтобы взять собаку из приюта?\n" +
            "Какие документы нужны чтобы взять кошку из приюта?\n" +
            "Если вы решились обзавестись новым членом семьи, ниже представлен список основных шагов и документов на собаку или кошку из приюта, которые у вас могут запросить (НЕ ВЕЗДЕ ДЕЙСТВУЮТ ОДИНАКОВЫЕ УСЛОВИЯ):\n" +
            "\n" +
            "Заявление на усыновление:\n" +
            "Вам нужно предоставить заявление в приют, в котором вы хотите усыновить собаку. В некоторых приютах это можно сделать онлайн, а в других — лично. Мы предоставляем универсальный образец стандартного заявления (шаблон договора о передаче животного).\n" +
            "Документы, удостоверяющие личность:\n" +
            "Паспорт гражданина России или иной документ, удостоверяющий личность. Копия и оригинал могут потребоваться для проверки личности.\n" +
            "Документы о месте жительства:\n" +
            "Справка о регистрации по месту жительства. Возможно, приют захочет удостовериться, что у вас достаточно места для содержания животного.\n" +
            "Справка о доходах:\n" +
            "В ряде приютов могут попросить предоставить справку о вашем финансовом положении. Это может быть необходимо для обеспечения достойного ухода за животным.\n" +
            "Согласие членов семьи:\n" +
            "Если у вас есть члены семьи, они также должны дать согласие на усыновление. Некоторые приюты могут попросить вас предоставить письменное согласие всех членов семьи, либо могут взять номера их телефонов, чтобы позвонить и убедиться в том, что они не против принятия нового члена семьи.\n" +
            "Фотографии места проживания:\n" +
            "Некоторые приюты могут попросить предоставить фотографии места, где будет проживать собака. Это делается для того, чтобы удостовериться, что условия будут комфортными для животного.\n" +
            "Справка от ветеринара (если есть):\n" +
            "Если у вас уже есть другие домашние животные, приют может запросить справку от ветеринара об их здоровье и прививках.\n" +
            "Обязательство об уходе за животным:\n" +
            "Некоторые приюты могут попросить вас подписать обязательство о том, что вы обеспечите должный уход за собакой. Такие обязательства могут быть прописаны в стандартном договоре о передаче животного.";

    /**
     * Правила транспортировки животного
     */
    public static String RULES_TRANSPORTATION = "Общие советы\n" +
            "\n" +
            "Животные ни в коем случае не должны свободно перемещаться по салону автомобиля — они могут отвлекать вас от дороги или даже залезть под педали. Если вам кажется, что зверь будет мешать вести машину, откажитесь от поездки.\n" +
            "\n" +
            "Как перевозить собак\n" +
            "\n" +
            "Собак перевозят в наморднике с поводком или шлейкой. Если собака небольшая, её можно возить без поводков и намордников — в переноске.\n" +
            "\n" +
            "Не все псы переносят поездки легко — у некоторых бывает стресс. Если у пассажира с собой подстилка, попросите постелить её на сиденье.";

    /**
     * Рекомендации по обусртойству дома для щенка
     */
    public static String RECOMENDATIONS_FOR_HOUSE_FOR_PUPPY = "- \n";

    /**
     * Рекомендации по обустройству дома для взрослой собаки
     */
    public static String RECOMENDATIONS_FOR_HOUSE_FOR_DOG = "-\n";

    /**
     * Рекомендации по обустройству дома для собак с огрниченными возможностями.
     */
    public static String RECOMENDATIONS_FOR_HOUSE_FOR_INVALID_PETS = "-\n";

    /**
     * Советы кинологов по первичному взаимодействию с собакой.
     */
    public static String DOGS_HANDLERS_ADVICE_ON_PRIMARY_COMUNICATION = "-\n";

    /**
     * Список проверенных кинологов для обращения к ним.
     */
    public static String DOG_HANDLERS = "Список проверенных кинологов для обращения:\n"+
            " - Российская кинологическая федерация (РКФ)**: https://rkf.org.ru/experts/\n";





    // информация до конца не добавлена
}
